{
  "workflowId": "687560f1a31b8ef6ec31541a",
  "runId": "68756324f47194a209e924e5",
  "executedAt": "2025-07-14T20:05:57.059Z",
  "data": [
    {
      "title": "2025 MLB Draft Scouting Report: Kade Anderson",
      "playerName": "Kade Anderson",
      "draftYear": 2025,
      "playerImage": "https://www.sportsinfosolutions.com/wp-content/uploads/2025/07/Kade-Anderson-1.jpg",
      "playerSummary": "One of the best college pitchers in the draft has a lot of upside with which to work.",
      "author": "Brandon Tew",
      "publishDate": "2025-07-10",
      "playerCollege": "LSU",
      "playerBio": "L/L 6-2, 179 lbs.",
      "playerDOB": "2004-07-06",
      "throws": "LHP",
      "fastballGrade": 55,
      "sliderGrade": 55,
      "curveballGrade": 55,
      "changeupGrade": 55,
      "controlCommandGrade": "55/55",
      "futureValueGrade": 55,
      "analysis": "Kade Anderson blends a deep arsenal with intensity and guts to bully hitters. Anderson possesses above-average stuff across the board, and while his pitch shapes might not be an outlier, his results speak to just how dominant he was at LSU in 2025. When you lead D1 Baseball in strikeouts with 180, you are performing at a high level throughout the season. He also threw the most innings this season (119)\n\nIf Anderson is successful in MLB, it will be because of his deep pitch mix and command of multiple pitches, overwhelming the zone with above-average stuff.\n\nIf he struggles, it will be due to a lack of fastball production, the opposite of what he displayed in college. Rather than tweaking some things, a team pushes him through levels too quickly.",
      "collegeCareerSummary": "Anderson, after an outstanding freshman campaign out of the bullpen, continued to pitch better as the season progressed and into the postseason in 2024. Anderson quickly cemented himself as the ace in Baton Rouge in 2025, demanding the ball and pitching deep into starts as much as possible. He averaged 101 pitches a game over 19 starts. \n\nUnderstanding that he pitches once a week is essential to evaluating this workload, but when Anderson had the ball, he rarely gave it up without pitching deep into the game.\n\nWith a 135-pitch shutout versus Oklahoma in April, Anderson pitched his absolute best on the Friday night stage. He then tossed a 130-pitch shutout in the CWS Finals against Coastal Carolina. Anderson’s performance helped the Tigers win another national title and vaulted him into the conversation as the best pitcher in this draft class.",
      "pitchingMechanics": "Anderson has a similar delivery to two left-handers that have been compared in the past from a visual standpoint, Max Fried and Cade Povich. The video below shows all three windups in sequence. Anderson also throws from a fluid arm stroke and a high 3/4 slot, similar to Povich and Fried.\n\n  \nIn a windup, Anderson starts with his glove at the belt, but will move it up to his face as he steps to the side, and he brings the glove back down to his belt. As he begins his leg lift, the glove rises to about chin height.\n\nAs he transitions from peak leg lift, he creates a drift and momentum forward, but with little counter-rotation in his front side. He moves smoothly into landing on the front foot, and his arm swing is smooth, and there’s some deception as he hides the ball well. The arm path is in pattern with the rest of his body, finishing in a good position as his front foot lands.\n\nHe throws with a slightly slower, more controlled tempo, but blocks out his lead leg to transfer energy well. While there is no significant uncoiling or unwinding of energy, his delivery is repeatable. With either added mass or even more powerful moves, Anderson could tap into even more velocity.\n\n  \nAnderson also plays with angles by moving on the rubber based on handedness, going to the first base side against lefties and the 3rd base side against righties.\n\nThis is an interesting choice considering Anderson primarily pitches to the glove side against lefties. Maybe he’s ok with the move over and farther angle to the outside part of the plate because he cuts his fastball.\n\nHe also could be trying to hide the ball better on his breaking balls against left-handed hitters. It would be interesting to see if a team would decide to have him stay on just one side of the mound.",
      "arsenal": "4s: 91-96 mph, Specs: 19” IVB 8” Arm-side | Release: 6′\n\nAnderson slightly cuts his four-seam fastball, and there’s variance in how he will throw the ball game to game or even in certain pitches in an at-bat. What’s intriguing about Anderson is that when looking at catcher locations for his four-seam fastball, he pushes his intended locations up and away from both left- and right-handed hitters.\n\nHe’s arm-side with the pitch against right-handed hitters and glove side with it against left-handed hitters. As mentioned above, since he moves on the pitching rubber based on handedness, the ball must travel farther and at a different angle to reach both targets.\n\nAnderson is ultra-aggressive in the zone with the pitch and uses the cut he creates to his advantage, especially against left-handed hitters. He uses the offering in first-pitch situations and two-strike ones at a decent rate to both righties and lefties. \n\nHe’s able to pick up in-zone whiffs on the pitch at an above-average rate, allowing him to get aggressive not only in the zone but also at the top of the zone. Even if the pitch is more middle-up rather than completely getting to the outside part of the plate, he can still win.\n\nHe will need to continue refining his command of the pitch in specific counts and spots, but a team should continue to have him carry the ball to the top of the zone. The frequency at which he does it might change with the baseballs used in the minors and eventually MLB balls.\n\nThe different ball used in college baseball does impact shape, so it would be wise to point out that Anderson would lose some ride on his fastball once in pro ball. Then, an organization would have to figure out if he can still dominate the top shelf with his fastball and if he can also blow it by professional hitters in the zone at the same rates as well.\n\nThat said, when he smells the finish line of an outing or needs a big pitch, he goes to the fastball and pitches with moxy. He can also reach back for one of two more ticks on the fastball as well, so there’s even hope that he can add velocity in pro ball with a few tweaks.",
      "slider": "84-87 mph Specs: -1” IVB, 7” Sweep\n\nAnderson’s second-most-used pitch to both handedness of hitters is his slider. He uses the pitch 24% of the time against righties and ups it to 35% of the time against lefties. He has a solid feel for zoning the pitch and gets aggressive with locations in the zone early in counts. He throws the slider with a little more depth at times so he can get back-foot with the pitch to right-handed hitters underneath the barrel.\n\nWith a high strike rate on all his secondaries, Anderson loves to use them. What I have noticed is that if Anderson doesn’t like a pitch called from the dugout, he will swipe on his pant leg to make it look like he’s shaking off a pitch to another one. His catcher will then sign in the pitch they want; more often than not, it’s a slider. \n\nI saw a couple of curveballs as well, and Anderson only swiped a handful of times. Still, it is interesting to note how much he loves throwing his slider in certain spots and even trusts the pitches’ utility to both left- and right-handed hitters. \n\nHis command of the pitch can be a little finer, but when he needs to place the pitch in the zone or get it down below the zone or out of it for chase, he can execute this particular pitch better than any other in his arsenal.\n\nThe upside for Anderson is that, if he continues to develop his slider, it will become an above-average pitch that will play at higher levels. With his ability to spin the ball and spin efficiency, he should be able to add more to his arsenal, either throwing an actual sweeper to left-handed hitters or adding a true cutter to attack the inside part of the plate for right-handed hitters. \n\nExpanding Anderson’s arsenal with glove-side breaking balls is the next step in his development, and it appears to be a very attainable goal.",
      "changeup": "82-85 mph Specs: 9” IVB 12” Arm-side\n\nAnderson’s change piece has good depth and fade to it, working below the zone for chase. His usage of the pitch leans towards opposite-handed hitters, where he throws it about 16% of the time to righties and targets it down and away, playing into the pitch’s characteristics. He zones the pitch a decent amount for an offspeed pitch, though, and hitters will take it in the zone. However, he allows the most damage when it is left up.\n\nIt’s a balance act between zoning the pitch for a strike or giving up a base hit in those scenarios, but the pitch is at its absolute best when he can dive it down from a right-handed hitter to get a swing over the top.\n\nAnderson’s ability to utilize his deep arsenal in different counts, as well as zone each pitch, allows him to use the changeup to get hitters out in front of the pitch and catch them off guard.\n\nAnderson also occasionally used the pitch to left-handed hitters as well, around 5% of the time as an extra wrinkle inside his arsenal. In its current form, he uses the pitch more away from left-handed hitters, avoiding down-and-in pitches to left-handed hitters, which is a safer bet in terms of location.\n\nIt at least shows a trust in the changeup altogether, and he has a nice feel for the pitch, as with all the pitches in his arsenal.",
      "curveball": "76-81 mph Specs: -15” IVB 11” Horizontal\n\nAnderson’s curve might be his best pitch from a pitch quality standpoint. It’s a big breaker that has a nice shape. He can add and subtract velocity on it, whether he wants to throw a get-me-over strike or bury the pitch in the dirt.\n\nHe would go to the pitch in count advantages when he was ahead by a strike or in some two-strike counts. If Anderson had a good feel for the release of his curve in a given start, he would mix it in the second and third times through the order. He even threw back-to-back curves at times, straying away from his aggressive fastball usage to certain hitters.\n\nWhatever team drafts Anderson will likely push his curveball velocity towards the higher end of his velocity band. However, there’s a real affinity for Anderson’s shape on the pitch, and he can zone it as a strike stealer early in counts. Additionally, his ability to get the pitch down under the zone for a swing and miss should also help it play with his fastball out of a good tunnel. \n\nUltimately, Anderson’s curve should be able to stay in his arsenal as a nice offering to add a change-of-pace during at-bats and some swing-and-miss as well.",
      "projection": "Anderson has the results to back up a deep arsenal, and he’s a safe bet to be some version of an MLB starter. There are likely some tweaks to be made to help Anderson reach a higher ceiling, and teams will appreciate the deep pitch mix and ability to throw strikes.\n\nWith a real chance to add other pitches in some form of a glove-side pitch, whether a sweeper or even a cutter, teams will like the different avenues they can approach Anderson’s player development in pro ball. This isn’t even to mention a sinker, which adds a nice wrinkle to protect the four-se.\n\nWhether the fastball and slider will eat up professional hitters the way they did college hitters might be a sticking point, as will keeping the ball in the park early in his pro ball career, if he’s still very aggressive in the zone. There’s enough command to push Anderson more away from the middle of the plate, though, where he allowed some of his most damage in college.\n\nStill, with Anderson, you’re getting a bulldog competitor who wants to see outings through to the end. Couple that with the clay to mold in terms of pitch mix, and there’s a solid floor, but if you can tap into more potential, Anderson could be a great return in value.",
      "_id": "f49bf791-410d-4204-83bf-48e374d9034b"
    }
  ],
  "totalCount": 1
}