{
  "workflowId": "687567c5a31b8ef6ec315492",
  "runId": "68756a18f47194a209e924ec",
  "executedAt": "2025-07-14T20:35:36.940Z",
  "data": [
    {
      "title": "MLB Draft Scouting Report: Kyson Witherspoon",
      "playerName": "Kyson Witherspoon",
      "draftYear": 2025,
      "playerImage": "https://www.sportsinfosolutions.com/wp-content/uploads/2025/07/DCV240523085_big_12.jpg",
      "playerSummary": "His success will mainly hinge on maximizing his pitch shapes says our MLB Draft expert",
      "author": "Brandon Tew",
      "publishDate": "2025-07-13",
      "playerCollege": "University of Oklahoma",
      "playerBio": "R/R 6-2, 206 lbs.",
      "playerDOB": "2004-08-12",
      "throws": "RHP",
      "fastballGrade": 60,
      "sliderGrade": 55,
      "curveballGrade": 55,
      "changeupGrade": 50,
      "controlCommandGrade": "50/50",
      "futureValueGrade": 50,
      "analysis": "Kyson Witherspoon is a compact, explosive mover on the mound. With a short extension that doesn’t even reach 6 feet and a short stabby arm path, Witherspoon has some deception and unconventional mechanics with enough strike throwing ability. \nHe has nice shapes on his pitches, including a high velocity cut-ride fastball and a big curveball. Teams will view him as a project they can mold into a starting pitcher, potentially with a deeper and expanded pitch mix than he currently has.\nIf Witherspoon succeeds in MLB, it will be by harnessing his explosive movements to command more of his pitches to both sides of the plate while also deepening his arsenal to include multiple distinct glove-side breaking balls and a solid offspeed pitch.\nWitherspoon might run into some trouble in pro ball if he has more fringe-average command. In that case, he will likely be seen as more of a reliever with solid pitches, capable of producing in a bullpen due to his average control; however, not enough stuff to pitch multiple times through the order.",
      "collegeCareerSummary": "After transferring from Northwest Florida State College, Witherspoon was a solid contributor in 2024, striking out 90 hitters in 80 innings. It came with some walks at an 11% walk rate and 40 walks surrendered.\nFast-forward to 2025, and Witherspoon was one of the most consistent Friday starters in the SEC, cutting his walk rate down while upping his strikeout rate. The improvement in command comes from more comfort in his delivery, but there’s still some upside in terms of commanding the ball even better.",
      "pitchingMechanics": "Witherspoon pitches exclusively out of the stretch, starting on the 3rd base side of the rubber. As he reaches peak leg lift, he begins to drift down the mound with his front hip significantly.\nAs the glove gets to the side of his ear, there’s a bit of counter-rotation created in the drift forward. As he comes out of the leg lift, he tilts his trunk and posture backwards as his hands break at shoulder height.\nWitherspoon then has a bit of jerkiness to him as he stabs his arm downward to get to his arm path. As he sinks into his back hip, he almost pushes down the mound, still trying to stay closed into front foot strike.\nHe lands heel to toe and creates a nice stretch across his chest in hip-shoulder separation that is solid as his arm flips up into position at front foot strike. At times, he looks rushed down the mound with possible early trunk rotation into landing. \nHe uses his explosive athleticism to transfer energy into the ball with less effort. He’s more of a short strider with a faster tempo down the mound in a more compact manner, but he’s aggressive down the mound in his moves and tempo.",
      "arsenal": "4-seam fastball: 95-98 mph avg, Specs: 19” IVB, 7” Arm-side | Release: 5.9’\nWitherspoon throws a power four-seam with some cutting action to it. He will try to elevate the pitch later in counts to put away hitters. Against either handedness, he will throw the pitch with two strikes.\nHe had a 24% whiff rate on the pitch this season and around a 20% in-zone whiff rate to both righties and lefties as well. The cut ride nature of the pitch doesn’t allow the ball to carry as much at times. It’s still an above-average shape, and adding in the velocity, and even with the slightly above-average release height, this is still a plus pitch.\nWitherspoon is more control over command right now with his four-seam in particular, and was very aggressive with the pitch. He allowed some damage on fastballs against left-handed hitters, possibly a byproduct of not getting the pitch inside to lefties.\nAlso, lefties sat fastball early against him, as he was more likely to throw a four-seam to start an at-bat or down early to left-handed hitters at a higher rate than right-handed hitters.\nWitherspoon uses pent-up energy and emotion to fuel his fastball when he wants to reach back for some more velocity. In big spots when he finished at-bats against hitters with a high-velocity fastball, he would display some of this energy on his way to the dugout.",
      "slider": "Slider: 84-89 mph Specs: 0” IVB, 5” Sweep \nCutter: 88-90 mph Specs: 6” IVB, 3” Sweep\nWitherspoon’s cutter and slider would blend in shape and velocity at points this season. The team drafting Witherspoon would likely push his cutter up a little and get higher velocity around 90-92 mph. \nWhile the slider would push more toward the depth slider, he would try to throw down and away to right-handed hitters. If he can consistently get the more down shape at around 85-87 mph, he can use the two separate offerings in the same tunnel. \nOr he can use the slider down in the zone and the cutter more toward the upper part of the zone, especially to left-handed hitters, to keep them off of his four-seam early in counts.\nWitherspoon loved using the cutter and slider down and away from right-handed hitters and leaned on zoning the cutter a bunch. If he can refine the command of these two offerings, especially the slider after reworking the vertical depth of the pitch, he can start to backfoot lefties to move their feet off the plate, opening up the outside of the plate more. \nHis cutter against left-handed hitters also pushes down and in mostly, so being able to get more carry on that pitch could move the location more in on the hands of left-handed hitters rather than around mid-thigh locations.\nWith his supination bias, there’s a chance a team will give him a bigger sweeper shape as well. For both handedness, there’s a multitude of routes Witherspoon can take with his pitch mix. If you add a sinker, you can also protect your other pitches on the outer part of the plate by throwing the sinker inside against righties. \nThese tweaks will likely come with how much you want to touch his mechanics, so there’s a threading-the-needle aspect to all of this, but the possible shapes you can get to from a pitch perspective are intriguing based on his current mix and three-quarters arm slot.",
      "changeup": "Changeup: 87-91 mph Specs: 11” IVB, 15” Arm-side \n(Also tinkered with a Splitter 89-90 mph)\nRather than talking about the current changeup shape, there’s an interesting tidbit I noticed about Witherspoon. He tinkered with his offspeed a lot this season.\nIn the first four starts of the season, he threw what looks like a four-seam changeup. Then, going into his start against South Carolina, he switched to a splitter grip.\nHe started in the splitter grip for about six starts before changing back to a four-seam changeup against Georgia in April. Then, to end the season based on the video, he went to a two-seam changeup.\nHis changeup and splitter were both firm offerings with little drop. An organization will continue to work with him in pro ball and help him find an orientation and grip that adds drop and reduces spin. He had an okay feel for these offerings, but he mostly threw changeups over the splitter he started gripping. He was also tagged on a couple of poorly-executed changeups late in the season, where the pitch just didn’t fade enough and stayed up.\nThere’s enough here to get to an average offspeed shape to use versus left-handed hitters, and maybe an even better one with pitching development continuing to improve with offspeed shapes and their usage.",
      "curveball": "Curveball: 76-80 mph Specs: -16” IVB, 10” Horizontal\nThe curve is a big knuckle curve that Witherspoon deployed in two-strike counts off of his fastball to both left-handed and right-handed hitters. He could throw the pitch below the zone or catch a batter unable to pull the trigger on a pitch dropped into the zone out of the sky.\nThe pitch had excellent results both in and out of the zone for whiffs to either platoon, and has the makings of an above-average offering that can neutralize hitters off of Witherspoon’s fastball and harder glove-side pitches.\nIf the curve can work against opposite-handed hitters in pro ball, even pushing velocity and intent to make it an even better pitch, this could lessen the impact of not having an average offspeed pitch to keep left-handed hitters honest, more than anything.\nWitherspoon, in general, can feel rushed down the mound, and his release of the curve can come and go from pitch to pitch with some terrible misses.\nHe does have overall a feel for the pitch, and his willingness to throw it in two-strike counts to both platoons makes the pitch a valuable piece of the puzzle for him.",
      "projection": "Witherspoon has intriguing pitch shapes in his cut ride fastball and breakers. A team will try to refine some pitches and also expand the arsenal, possibly giving him a deeper mix to attack hitters with.\nThere is a possibility to get to plus shapes in the slider and fastball, putting him more in a middle rotation spot. As an explosive athlete, there’s also room to get more out of his body, not only from an extension and movement standpoint but also cleaning up his delivery if a team so chooses.\nHis success will mainly hinge on maximizing his pitch shapes and either moving well enough in his current delivery as an athletic righthander or making some tweaks to unlock better command of pitches. \nThere’s enough of a floor here to like Witherspoon as more of a back-end bullpen piece. Teams will bet on the upside and molding him into a No.4 or No.5 starter with some mid-rotation upside if it all clicks.\nAesthetics Comp: Zach Plesac (Delivery and arm action)",
      "_id": "ba36cc14-1e18-447f-b49c-d37389e60d19"
    }
  ],
  "totalCount": 1
}